{
   "Amendment dictionary can be found L<here|https://github.com/kaz-utashiro/greple-subst/blob/master/share/ms-amend.dict>. Please raise an issue or send a pull-request if you have request to update.\n" : "修正辞書は、L<こちら|https://github.com/kaz-utashiro/greple-subst/blob/master/share/ms-amend.dict>で見ることができます。更新の要望があれば、issueを送るか、pull-requestを送信してください。\n",
   "Create new file and write the result. Suffix \".new\" is appended to original filename.\n" : "新規ファイルを作成し、結果を書き込む。元のファイル名の末尾に\".new \"が付加されます。\n",
   "Created from following guideline document.\n" : "以下のガイドラインに基づいて作成されています。\n",
   "Customized B<--jtca-katakana-guide>. Original dictionary is automatically generated from published data. This dictionary is customized for practical use.\n" : "B<--jtca-katakana-guide>をカスタマイズしたもの。オリジナルの辞書は公開されたデータから自動生成されたものです。この辞書は、実用のためにカスタマイズされている。\n",
   "Customized B<--jtf-style-guide>. Original dictionary is automatically generated from published data. This dictionary is customized for practical use.\n" : "カスタマイズB<--jtf-style-guide>。オリジナル辞書は公開データから自動生成される。この辞書は、実用に耐えるようにカスタマイズされている。\n",
   "Customized B<--ms-style-guide>. Original dictionary is automatically generated from published data. This dictionary is customized for practical use.\n" : "カスタマイズされたB<--ms-style-guide>。オリジナルの辞書は、公開されたデータから自動生成されたものです。本辞書は、実用化に向けてカスタマイズしたものです。\n",
   "Data is generated from this article:\n" : "本記事から生成されたデータです。\n",
   "Dictionary data can also be written separated by C<//> as follows:\n" : "辞書データは、次のようにC<//>で区切って書くこともできます：\n",
   "Dictionary entry starting with a sharp sign (C<#>) is a comment and ignored.\n" : "シャープ記号(C<#>)で始まる辞書項目はコメントとなり、無視される。\n",
   "Dictionary file is given by B<--dict> option and each line contains matching pattern and expected string pairs.\n" : "辞書ファイルはB<--dict>オプションで与えられ、各行にはマッチするパターンと期待される文字列のペアが含まれます。\n",
   "Dictionary generated from Microsoft localization style guide.\n" : "Microsoftのローカライズスタイルガイドから生成された辞書。\n",
   "Dictionary used for \"C/C++ セキュアコーディング 第2版\" published in 2014.\n" : "2014年に出版された「C/C++ セキュアコーディング 第2版」で使用された辞書。\n",
   "If the dictionary file contains following data:\n" : "辞書ファイルが以下のようなデータを含んでいる場合\n",
   "If the matched string overlaps with previously matched string, it is warned (B<--warn-overlap> by default) and ignored.\n" : "マッチした文字列が前にマッチした文字列と重なる場合、警告を出し (デフォルトでは B<--warn-overlap)、無視される。\n",
   "If the target data is folded in the middle of text, use B<--linefold> option. It creates regex patterns which matches string spread across lines. Substituted text does not include newline, though. Because it confuses regex behavior somewhat, avoid to use if possible.\n" : "B<--linefold>オプションは、対象データがテキストの途中で折り返されている場合に使用します。行をまたぐ文字列にマッチする正規表現パターンが作成されます。ただし、置換される文字列には改行が含まれません。正規表現の動作を多少混乱させるので、なるべく使わないでください。\n",
   "If you don't need to see pattern field, use like this:\n" : "patternフィールドを表示する必要がない場合は、このように使用します。\n",
   "In practice, the last two elements of a space-separated string are treated as a pattern and a replacement string, respectively.\n" : "実際には、スペースで区切られた文字列の最後の2つの要素は、それぞれパターンと置換文字列として扱われる。\n",
   "Japanese KATAKANA word have a lot of variants to describe same word, so unification is important but it's quite tiresome work. In the next example,\n" : "日本語のカタカナ語は、同じ言葉を表すのにいくつものバリエーションがあるので、統一することが重要ですが、かなり面倒な作業です。次の例では\n",
   "L<https://github.com/kaz-utashiro/greple-subst>\n" : "L<https://github.com/kaz-utashiro/greple-subst>\n",
   "L<https://github.com/kaz-utashiro/greple-update>\n" : "L<https://github.com/kaz-utashiro/greple-update>\n",
   "L<https://github.com/kaz-utashiro/greple>\n" : "L<https://github.com/kaz-utashiro/greple>\n",
   "L<https://qiita.com/kaz-utashiro/items/85add653a71a7e01c415>\n" : "L<https://qiita.com/kaz-utashiro/items/85add653a71a7e01c415>\n",
   "L<https://www.jtca.org/standardization/katakana_guide_3_20171222.pdf>\n" : "L<https://www.jtca.org/standardization/katakana_guide_3_20171222.pdf>\n",
   "L<https://www.jtf.jp/jp/style_guide/styleguide_top.html>, L<https://www.jtf.jp/jp/style_guide/pdf/jtf_style_guide.pdf>\n" : "L<https://www.jtf.jp/jp/style_guide/styleguide_top.html>, L<https://www.jtf.jp/jp/style_guide/pdf/jtf_style_guide.pdf>\n",
   "L<https://www.microsoft.com/ja-jp/language/styleguides>, L<https://www.atmarkit.co.jp/news/200807/25/microsoft.html>\n" : "L<https://www.microsoft.com/ja-jp/language/styleguides>，L<https://www.atmarkit.co.jp/news/200807/25/microsoft.html>。\n",
   "L<イーハトーブ|https://ja.wikipedia.org/wiki/%E3%82%A4%E3%83%BC%E3%83%8F%E3%83%88%E3%83%BC%E3%83%96>\n" : "L<イーハトーブ|https://ja.wikipedia.org/wiki/%E3%82%A4%E3%83%BC%E3%83%8F%E3%83%88%E3%83%BC%E3%83%96>\n",
   "L<文化庁 国語施策・日本語教育 国語施策情報 内閣告示・内閣訓令 外来語の表記|https://www.bunka.go.jp/kokugo_nihongo/sisaku/joho/joho/kijun/naikaku/gairai/index.html>\n" : "L＜文化庁 国語施策・日本語教育 国語施策情報 内閣告示・内閣訓 外来語の表記|https://www.bunka.go.jp/kokugo_nihongo/sisaku/joho/joho/kijun/naikaku/gairai/index.html>\n",
   "Multiple parameters can be set at once:\n" : "複数のパラメータを一度に設定することができます。\n",
   "Option B<--check> takes argument from C<ng>, C<ok>, C<any>, C<outstand>, C<all> and C<none>.\n" : "オプションB<--check>は、C<ng>, C<ok>, C<any>, C<outstand>, C<all>, C<none>から引数を取ります。\n",
   "Option B<--dictdata> can be used to provide dictionary data in command line.\n" : "B<--dictdata>オプションは、コマンドラインで辞書データを提供するために使用することができる。\n",
   "Option B<--diff> produce diff output of original and converted text.\n" : "B<--diff>オプションは、変換前のテキストと変換後のテキストの差分を出力する。\n",
   "Option B<--with-stat> print statistics after normal output, while B<--stat> print only statistics.\n" : "B<--with-stat>オプションは通常の出力の後に統計情報を出力し、B<--stat>は統計情報のみを出力します。\n",
   "Overwrite the target file by converted result with no backup.\n" : "バックアップを取らずに、変換後のファイルを上書きします。\n",
   "Print statistical information. Works with B<--check> option.\n" : "統計情報を表示します。B<--check>オプションと併用する。\n",
   "Replace the target file by converted result. Original file is renamed to backup name with \".bak\" suffix.\n" : "対象ファイルを変換後の結果で置き換えます。元ファイルはバックアップ名に\".bak \"を付けてリネームされます。\n",
   "Select I<N>th entry from the dictionary. Argument is interpreted by L<Getopt::EX::Numbers> module. Range can be defined like B<--select>=C<1:3,7:9>. You can get numbers by B<--stat> option.\n" : "I<N>番目のエントリを辞書から選択する。引数はL<Getopt::EX::Numbers>モジュールによって解釈される。範囲はB<--select>=C<1:3,7:9>のように定義することができる。B<--stat>オプションで数値を取得することができる。\n",
   "Show dictionary directory.\n" : "辞書ディレクトリを表示します。\n",
   "Some terminals (eg: \"Apple_Terminal\" or \"iTerm\") are detected automatically and no action is required. Otherwise set B<TERM_BGCOLOR> environment to #000000 (black) to #FFFFFF (white) digit depending on terminal background color.\n" : "一部の端末 (例: \"Apple_Terminal\" や \"iTerm\") は自動的に検出され、何もする必要はない。それ以外の場合は、B<TERM_BGCOLOR>環境変数に#000000（黒）〜#FFFFFF（白）の数字を設定し、端末の背景色に依存する。\n",
   "Specify dictionary data by text.\n" : "辞書データをテキストで指定する。\n",
   "Specify dictionary file.\n" : "辞書ファイルを指定する。\n",
   "Specify diff command name used by B<--diff> option. Default is \"diff -u\".\n" : "B<--diff>オプションで使用するdiffコマンド名を指定します。デフォルトは \"diff -u \"です。\n",
   "Specify which item is shown up in stat information. Default values are:\n" : "統計情報に表示される項目を指定する。デフォルト値は\n",
   "Substitute unexpected matched pattern to expected string. Newline character in the matched string is ignored. Pattern without replacement string is not changed.\n" : "マッチしたパターンを期待される文字列に置き換えます。マッチした文字列の改行文字は無視されます。置換文字列のないパターンは変更されません。\n",
   "There must be spaces before and after the C<//>. In this format, strings before and after it are treated as a pattern and replacement string, rather than last two element. Leading spaces and spaces before and after C<//> are ignored, but all other whitespace is valid.\n" : "C<//>の前後には空白を入れなければなりません。この形式では、その前後の文字列は、最後の2つの要素ではなく、パターン文字列と置換文字列として扱われます。先頭の空白とC<//>の前後の空白は無視されますが、その他の空白はすべて有効です。\n",
   "This B<greple> module supports check and substitution of text files based on dictionary data.\n" : "この B<greple> モジュールは、辞書データに基づくテキストファイルのチェックと置換をサポートします。\n",
   "This module helps to detect and correct them.\n" : "このモジュールは、これらの単語を検出し、修正するのに役立つ。\n",
   "This module includes example dictionaries. They are installed share directory and accessed by B<--exdict> option.\n" : "本モジュールには、サンプル辞書が含まれています。これらは共有ディレクトリにインストールされ、B<--exdict>オプションでアクセスすることができる。\n",
   "This module is originaly made for Japanese text editing support.\n" : "このモジュールは、日本語のテキスト編集をサポートするためにオリジナルで作成されました。\n",
   "This version uses L<Getopt::EX::termcolor> module. It sets option B<--light-screen> or B<--dark-screen> depending on the terminal on which the command run, or B<TERM_BGCOLOR> environment variable.\n" : "このバージョンでは、L<Getopt::EX::termcolor> モジュールを使用する。これは、コマンドを実行した端末、または環境変数B<TERM_BGCOLOR>に応じて、B<--light-screen>またはB<--dark-screen>オプションを設定する。\n",
   "Use I<dictionary> flie in the distribution as a dictionary file.\n" : "辞書ファイルとしては、配布されているI<dictionary> flieを使用する。\n",
   "Using B<--stat-style=dict> option with B<--stat> and B<--check=any>, you can get dictionary style output for your working document.\n" : "B<--stat>とB<--check=any>にB<--stat-style=dict>オプションを併用すると、作業文書に対して辞書風の出力を行うことができる。\n",
   "Value C<all> and C<none> make sense only when used with B<--stat> option, and display information about never matched pattern.\n" : "C<all>とC<none>はB<--stat>オプションと一緒に使われたときだけ意味があり、マッチしなかったパターンに関する情報を表示する。\n",
   "Warn included pattern. Default off.\n" : "含まれるパターンを警告します。デフォルトはオフ。\n",
   "Warn overlapped pattern. Default on.\n" : "オーバーラップしたパターンを警告します。デフォルトはonです。\n",
   "When the matched string is same or shorter than previously matched string by another pattern, it is simply ignored (B<--no-warn-include> by default). So, if you have to declare conflicted patterns, place the longer pattern earlier.\n" : "マッチした文字列が、以前に別のパターンでマッチした文字列と同じか短い場合は、単に無視される (デフォルトでは B<--no-warn-include>)。したがって、矛盾するパターンを宣言する必要がある場合は、長い方のパターンを先に配置する。\n",
   "With default value C<outstand>, command will show information about both expected and unexpected words only when unexpected word was found in the same file.\n" : "デフォルトのC<outstand>では、同じファイルに予想外の単語があった場合のみ、予想外の単語と予想外の単語の両方についての情報を表示します。\n",
   "With value C<ng>, command will show information about unexpected words. With value C<ok>, you will get information about expected words. Both with value C<any>.\n" : "C<ng>を指定すると、予期しない単語についての情報を表示します。値C<ok>を指定すると、予想される単語についての情報を表示します。値C<any>の場合は両方です。\n",
   "You can use same file by B<greple>'s B<-f> option and string after C<//> is ignored as a comment in that case.\n" : "B<greple>のB<-f>オプションで同じファイルを使うこともでき、その場合はC<//>の後ろの文字列はコメントとして無視される。\n",
   "above command finds the first pattern which does not match the second string, that is \"colour\" and \"centre\" in this case.\n" : "上記のコマンドは、2番目の文字列にマッチしない最初のパターン、つまり、この場合、\"color \"と \"center \"を見つける。\n",
   "greple -Msubst --dict I<dictionary> [ options ]\n" : "greple -Msubst --dict I<dictionary> [ オプション ]。\n",
   "left pattern matches all following words.\n" : "左のパターンは、次の単語全てにマッチします。\n",
   "subst - Greple module for text search and substitution\n" : "subst - テキスト検索と置換のための Greple モジュール\n"
}
